// story:maofang

#include <ansi.h>

string give_gift();

private mixed *story = ({
        "沈浪：咦？兄台，在下有一事不知道当问不当问？",
        "熊猫儿：嗯...有什么事，老兄你尽管说。咱们江湖兄弟不必那么文绉绉的，直接点。",
        "沈浪：好！兄台果然是爽快之人！我想问的是：兄台是不是河北神腿门的弟子？",
        "熊猫儿：嗯...正是！不知道老兄怎么知道的？",
        "沈浪：呵呵，我看兄台这蹲马步的姿势－－双脚脚尖微微向内，双腿的膝盖却向外，小腿与大腿之间的角度成一直角，上身前倾，这便是河北神腿门的基本功嘛。",
		"沈浪：说起来咱们算是本家。我是唐山地趟门的。三十年前，咱们本是一家，都属于神腿门。",
		"熊猫儿：嗯...原来如此，怪不得看老兄你蹲马步的姿势跟我差不多呢。嗯",
		"沈浪：呵呵，我蹲的姿势和兄台还是有些区别的。神腿门注重的练腿的力量，我们地趟门练的是轻巧，所以我们蹲马步和你们有一点不同。",
		"沈浪接着道：我们的双脚不是平行的，而是一脚微微在前，一脚微微在后，为以后的[急行花步]打基础。",
		"熊猫儿听后憨笑：哈哈，看来老兄是悟性很高的高手啊。嗯……俺是个粗人，不管这些，只管苦练。嗯…",
		"沈浪谦虚地说：呵呵，兄台过奖了！悟性是一方面，苦练才是最重要的啊。",
		"熊猫儿：嗯...",
		"沈浪：蹲茅房能遇你这样一个知已，真的很开心！……嗯…",
		"熊猫儿：嗯…我也是。",
        "沈浪：" HIC "哎呀！" NOR,
        "熊猫儿：兄台，怎么了？",
        "沈浪：刚往兜里拿手纸，不小心把一锭金子弄掉了。",
		"熊猫儿：啊，那得赶紧找！",
        (: give_gift :)
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

string give_gift()
{
        STORY_D->give_gift("/obj/money/gold", 1,
                           HIM "\n“啪”的一声一锭金子掉到你面前。\n\n" NOR);
        return HIM "听说沈浪和熊猫儿从此以后建立了深厚的友谊。\n" NOR;
}
