// story:laojun 西游

#include <ansi.h>

int give_gift();

private mixed *story = ({
        "月圆之夜，紫金之颠。",
        "叶孤城：西门，你怎么还不拔剑，你在等什么？",
        "西门吹雪：老叶，这你就不懂了，这叫拔剑术！",
        "叶孤城：拔剑术？哈哈，你少唬人了，来吧，让我看看是你的寒天吹雪剑厉害还是我的天外飞仙更胜一筹。",
        "西门吹雪：你出招吧，我的剑就在我的心中，随时随地可以出剑。",
        "叶孤城：哼，不知死活的东西。一～剑～西～来～天～外～飞～仙～",
        "啊－－－－－－－－－－－",
        "西门吹雪：＃◎￥※※……靠，生锈了，拔不出来了",
		"西门吹雪气呼呼地把手上的剑连带剑鞘朝叶孤城扔去",
        "距离太近了，叶孤城闪躲不及，只能以剑御剑。",
        "两剑相撞，冒出火花，只听“铛”的一声，西门吹雪的那把剑鞘上的珠子掉了一颗。",
        "西门吹雪：此战算我败了，来日定当再次比试。说完头也不回地走了。",
		"叶孤城捡起刚才掉落的珠子，看了看：不过是块普通的石头。随手一扔也消失在圆月之下。",
		 (: give_gift :),

});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

int give_gift()
{
        STORY_D->give_gift("/obj/weapons/banzhi4", 1,
                           HIM "\n“啪”的一声一块东西掉到你面前。\n\n" NOR);
        return 1;
}
