inherit ROOM;
void create()
{
        set("short", "½ğÇ®°ï´óÔº");
        set("long", @LONG
´óÔºÀïÀäÀäÇåÇå£¬Ò²¾²µÄ³öÆæ¡£ÔºÖĞµÄÀÏÊ÷ÔÚµØÉÏÍÏ³ö³¤³¤µÄÓ°×Ó¡£Å¼¶û¼¸ÉùÄñ½Ğ£¬
´òÆÆËÀÉòÉòµÄ¼Å¾²¡£Î¢·ç´µ¹ı£¬Ê÷Ò¶Îè¶¯£¬·¢³ö¡°É³É³¡±µÄÉùÒô¡£»ÆÉ³µÄµØÃæÆÌÂú¿İ»Æ
µÄÂäÒ¶¡£¼¸Ìõ»ÆÉ«µÄÈËÓ°ÔÚÒõ°µµÄ½ÇÂäÀïºöÒşºöÏÖ¡£
Ò»¿éÄ¾ØÒÊ®·ÖÈôÈË×¢Ä¿£¬ÉÏÃæÁú·É·ïÎèµÄĞ´×Å:

                  [37;40m©³©¥©¥©¥©¥©¥©¥©¥©¥©¥©·[0m
                  [37;40m©§[33m   ½ğ Ç® ×Ü Ì³ [37;40m   ©§[0m
                  [37;40m©»©¥©¥©¥©¥©¥©¥©¥©¥©¥©¿[0m

LONG
        );
        set("exits", ([ /* sizeof() == 4 */
  "east" : __DIR__"swind2",
  "west" : __DIR__"jting",
]));
        set("outdoors", "fengyun");
        set("coor/x",-10);
	set("coor/y",-20);
	set("coor/z",0);
	set("coor/x",-10);
	set("coor/y",-20);
	set("coor/z",0);
	setup();
        replace_program(ROOM);
}
